nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxa344/demo_apps/mc_pmsm/pmsm_enc/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u         /*!<@brief Input Buffer Enable: Enables */
#define PORT2_PCR2_MUX_mux11 0x03u /*!<@brief Pin Multiplex Control: Alternative 3 (chip-specific) */

/*! @name PORT3_18 (number 57), LED_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_RED_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_RED_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_RED_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LED_RED_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_RED_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_RED_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_RED_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_19 (number 56), LED_GREEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_GREEN_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_GREEN_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_GREEN_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LED_GREEN_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_GREEN_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_GREEN_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_GREEN_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_21 (number 54), LED_BLUE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_BLUE_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_BLUE_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_BLUE_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LED_BLUE_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_BLUE_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_BLUE_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_BLUE_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_7 (number 100), SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW2_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW2_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SW2_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW2_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW2_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT3_0 (number 73), PWM_AT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_PWM_AT_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_PWM_AT_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_PWM_AT_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT3_1 (number 72), PWM_AB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_PWM_AB_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_PWM_AB_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_PWM_AB_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT3_8 (number 69), PWM_BT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_PWM_BT_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_PWM_BT_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_PWM_BT_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT3_9 (number 68), PWM_BB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_PWM_BB_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_PWM_BB_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_PWM_BB_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT3_10 (number 67), PWM_CT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_PWM_CT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_PWM_CT_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_PWM_CT_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT3_11 (number 66), PWM_CB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_PWM_CB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_PWM_CB_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_PWM_CB_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);

#define PCR_IBE_ibe0 0x00u /*!<@brief Input Buffer Enable: Disables */

/*! @name PORT1_4 (number 97), VOLT_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC_VOLT_DCB_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC_VOLT_DCB_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITADC_VOLT_DCB_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_10 (number 3), CUR_B
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC_CUR_B_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC_CUR_B_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITADC_CUR_B_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT3_30 (number 49), CUR_C
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC_CUR_C_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC_CUR_C_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITADC_CUR_C_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);

#define PCR_IBE_ibe0 0x00u         /*!<@brief Input Buffer Enable: Disables */
#define PORT2_PCR4_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMP(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENC(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
